# Shell Dependencies
brew 'stow' # dotfiles management
brew 'zsh'
brew 'antigen'

# Other CLI
brew 'tmux'
brew 'tmate'
brew 'git', override_system_git: true
brew 'tig'
brew 'rg'
brew 'z'
brew 'direnv'
brew 'mas'
brew 'hub'
brew 'tree'
brew 'nmap'
brew 'graphviz'

# Files
brew 'syncthing'

# Editing
brew 'vim', override_system_vim: true

# Code highlighting for Keynote
brew 'highlight'

# Linting
brew 'shellcheck'
brew 'yamllint'

# Casks
cask 'firefox'
cask 'slack'
cask 'alfred'
cask 'iterm2'
cask 'dash'
cask 'little-snitch'
cask 'arq'
cask 'paw'
cask 'bartender'
cask 'wireshark'
cask 'karabiner-elements'
cask 'zoomus'
cask 'docker'
cask 'rescuetime'
cask 'recordit'
cask 'whatsapp'
cask 'devonthink-pro-office'
cask 'syncthing'
cask 'screenflow'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-roboto-mono-for-powerline'

# Node
brew 'node@10'
brew 'yarn'

# gRPC
brew 'prototool'
brew 'grpcurl'

tap 'ktr0731/evans'
brew 'evans'

# Accounting
brew 'ledger'

# Mac App Store
mas 'airmail', id: 918858936
mas 'synalize-it-pro', id: 475193367
mas 'shush', id: 496437906
mas 'magnet', id: 441258766
mas 'tweetbot', id: 557168941
mas '1password', id: 443987910
mas 'omnifocus', id: 1346203938 
mas 'focus', id: 777233759
mas 'scrivener', id: 1310686187
mas 'quiver', id: 866773894
