# Shell Dependencies
brew 'stow' # dotfiles management
brew 'zsh'
brew 'antigen'

# Other CLI
brew 'tmux'
brew 'tmate'
brew 'git', override_system_git: true
brew 'tig'
brew 'rg'
brew 'z'
brew 'direnv'
brew 'mas'

# Editing
brew 'vim', override_system_vim: true

# Linting
brew 'shellcheck'

# Casks
cask 'firefox'
cask 'slack'
cask 'alfred'
cask 'iterm2'
cask 'dash'
cask 'little-snitch'
cask 'arq'
cask 'paw'
cask 'bartender'
cask 'wireshark'
cask 'karabiner-elements'
cask 'zoomus'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-roboto-mono-for-powerline'

# Mac App Store
mas 'airmail', id: 918858936
mas 'synalize-it-pro', id: 475193367
mas 'shush', id: 496437906
mas 'magnet', id: 441258766
mas 'tweetbot', id: 557168941
mas '1password', id: 443987910
